www/templates/Get Queue Items.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="urn:localhost-paint" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns2="http://xml.apache.org/xml-soap" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<SOAP-ENV:Body>
		<ns1:handleRequest>
			<contextId xsi:type="xsd:string">01234567890</contextId>
			<className xsi:type="xsd:string">bus_facade_data_scheduler</className>
			<processName xsi:type="xsd:string">getQueueItems</processName>
			<entityData xsi:type="ns2:Map">
  
			</entityData>
			<processData xsi:type="ns2:Map">
				<item>
					<key xsi:type="xsd:string">actionData</key>
					<value xsi:type="ns2:Map">
						<item>
							<key xsi:type="xsd:string">supportedSystems</key>
							<value xsi:type="ns2:Map">
								<item>
									<key xsi:type="xsd:string">systemType</key>
									<value xsi:type="xsd:string">msdynamics_crm_2011_op</value>
								</item>
							</value>
						</item>
					</value>
				</item>
			</processData>
		</ns1:handleRequest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
